JulesCalella/ADB-02X/dsPIC33CH512MP506_Pins.c
#include <xc.h>
#include <p33CH512MP506.h>
#include "dsPIC33CH512MP506_Pins.h"
#include "dsPIC33CH512MP506_Audio.h"

buttonStruct playPauseButton;
buttonStruct rewindButton;
buttonStruct fastForwardButton;
buttonStruct saveButton;
buttonStruct loadButton;
buttonStruct leftButton;
buttonStruct rightButton;
buttonStruct upButton;
buttonStruct downButton;

// ** Global Variables ** //
enum ledNames{sine = 0, sawtooth, instrument, one, four, seven, f1,
              square, attack, memory, two, five, eight, f2,
              triangle, decay, tempo, three, six, nine, f3,
              d22e, d22d, d22c, d22b, d22a, d22f, d22g,
              d23e, d23d, d23c, d23b, d23a, d23f, d23g,
              d24e, d24d, d24c, d24b, d24a, d24f, d24g};
              
int currentLed = 0;
int ledControlEnabled = 1;
int ledControlArray[42];
int currentLedOn = 0;
int numberDisplay;
int interfaceSelection = 0;
int selectionAmplitude;
int selectionChanged = 1;
int audioControlArray[18];

int tempCounter = 0;

// ** Functions ** //
int pinInit()
{
    LATA = 0x0000;
    LATB = 0x0000;
    LATC = 0x0000;
    LATD = 0x0000;
    
    // Configure LED Pins as Outputs
    TRISBbits.TRISB14 = 0;  // LED1
    TRISBbits.TRISB15 = 0;  // LED2
    TRISCbits.TRISC12 = 0;  // LED3
    TRISCbits.TRISC13 = 0;  // LED4
    TRISCbits.TRISC14 = 0;  // LED5
    TRISCbits.TRISC15 = 0;  // LED6
    TRISDbits.TRISD15 = 0;  // LED7
    TRISDbits.TRISD14 = 0;  // CTRL1
    TRISDbits.TRISD13 = 0;  // CTRL2
    TRISCbits.TRISC0 = 0;   // CTRL3
    TRISAbits.TRISA0 = 0;   // CTRL4
    TRISAbits.TRISA1 = 0;   // CTRL5
    TRISAbits.TRISA2 = 0;   // CTRL6
    
    // Configure Button Pins as Inputs
    TRISAbits.TRISA3 = 1;   // BTN1
    TRISAbits.TRISA4 = 1;   // BTN2
    TRISDbits.TRISD12 = 1;  // BTN3
    TRISCbits.TRISC1 = 1;   // BTN4
    TRISCbits.TRISC2 = 1;   // BTN5
    TRISCbits.TRISC6 = 1;   // BTN6
    TRISCbits.TRISC3 = 1;   // BTN7
    TRISDbits.TRISD11 = 1;  // BTN8
    TRISDbits.TRISD10 = 1;  // BTN9
    
    // Disable Analog Pins
    ANSELA = 0x0000;
    ANSELB = 0x0000;
    ANSELC = 0x0000;
    ANSELD = 0x0000;
    
    // Configure AK4386 Pins
    // Set as I2S
    TRISDbits.TRISD4 = 0;   // DIF0
    LATDbits.LATD4 = 1;
    TRISCbits.TRISC11 = 0;  // DIF1
    LATCbits.LATC11 = 1;
    // Half Speed
    TRISDbits.TRISD1 = 0;   // DFS0
    LATDbits.LATD1 = 0;
    TRISDbits.TRISD2 = 0;   // DFS1
    LATDbits.LATD2 = 1;
    // Deemphasis Filter (OFF)
    TRISDbits.TRISD3 = 0;
    LATDbits.LATD3 = 0;
    
    TRISDbits.TRISD0 = 0;   // PDN
    LATDbits.LATD0 = 0;
    
    // Configure I2C Pins 
    TRISBbits.TRISB8 = 0;
    TRISBbits.TRISB9 = 0;
    
    // Configure I2S pins
    TRISBbits.TRISB13 = 0;
    TRISBbits.TRISB12 = 0;
    TRISBbits.TRISB11 = 0;
    TRISBbits.TRISB10 = 0;
    //__builtin_write_RPCON(0x55);
    //__builtin_write_RPCON(0xAA);
    NVMKEY = 0x55;
    NVMKEY = 0xAA;
    __builtin_write_RPCON(0x0000);
    // SCK1 = 6; SDO1 = 5; SS1 = 7; REFCLKO = 14;
    RPOR6bits.RP45R = 14;   // MCLK = RP45/RB13
    RPOR6bits.RP44R = 6;    // BLCK = RP44/RB12
    RPOR5bits.RP43R = 5;    // SDTI = RP43/RB11
    RPOR5bits.RP42R = 7;    // LRCK = RP42/RB10
    RPOR4bits.RP40R = 0;    // RB8 tied to default pin
    RPOR4bits.RP41R = 0;    // RB9 tied to default pin
    NVMKEY = 0x55;
    NVMKEY = 0xAA;
    __builtin_write_RPCON(0x0800);
    
    // Configure Reference Clock (12 MHz / 256 = 46,875 Hz)
    REFOCONLbits.ROEN = 0;
    while((REFOCONL & 0x0100) != 0) continue;
    REFOCONL = 0x3800; // 0011 1000 0000 0000
    REFOCONH = 4;   // 96MHz / (2*4) = 12MHz
    while(REFOCONLbits.ROSWEN == 1) continue;
    REFOCONLbits.ROEN = 1;
    
    // Configure Additional Pins
    TRISDbits.TRISD7 = 0;   // WP
    set_wp(1);
    io_ffc1(1);
    io_ffc2(1);
    io_ffc3(1);
    io_ffc4(1);
    io_ffc5(1);
    io_ffc6(1);
    io_ffc7(1);
    io_ffc8(1);
    io_ffc9(1);
    io_ffc10(1);
    io_ffc11(1);
    io_ffc12(1);
    
    // Turn off all LEDs
    ledsOff();
    
    return 0;
}

int ak4386Init()
{
    // Find device
    
    return 0;
}

void readButtons()
{
    int status = BTN1;
    updateButton(&rewindButton, &ctrlRewind, status);
    status = BTN2;
    updateButton(&playPauseButton, &ctrlPlay, status);
    status = BTN3;
    updateButton(&fastForwardButton, &ctrlFastForward, status);
    status = BTN4;
    updateButton(&loadButton, &ctrlLoad, status);
    status = BTN5;
    updateButton(&saveButton, &ctrlSave, status);
    status = BTN6;
    updateButton(&leftButton, &ctrlLeft, status);
    status = BTN7;
    updateButton(&upButton, &ctrlUp, status);
    status = BTN8;
    updateButton(&rightButton, &ctrlRight, status);
    status = BTN9;
    updateButton(&downButton, &ctrlDown, status);
}

void ctrlRewind(int buttonHold)
{
    // Disable other active states in case multiple buttons are pressed
    playPauseButton.isActive = 0;
    fastForwardButton.isActive = 0;
    loadButton.isActive = 0;
    saveButton.isActive = 0;
    leftButton.isActive = 0;
    rightButton.isActive = 0;
    upButton.isActive = 0;
    downButton.isActive = 0;
    
    if(buttonHold == 0){
        setScoreArray(0, 0);
    }
}

void ctrlPlay(int buttonHold)
{
    // Disable other active states in case multiple buttons are pressed
    rewindButton.isActive = 0;
    fastForwardButton.isActive = 0;
    loadButton.isActive = 0;
    saveButton.isActive = 0;
    leftButton.isActive = 0;
    rightButton.isActive = 0;
    upButton.isActive = 0;
    downButton.isActive = 0;
}

void ctrlFastForward(int buttonHold)
{
    // Disable other active states in case multiple buttons are pressed
    rewindButton.isActive = 0;
    playPauseButton.isActive = 0;
    loadButton.isActive = 0;
    saveButton.isActive = 0;
    leftButton.isActive = 0;
    rightButton.isActive = 0;
    upButton.isActive = 0;
    downButton.isActive = 0;
}

void ctrlLoad(int buttonHold)
{
    // Disable other active states in case multiple buttons are pressed
    rewindButton.isActive = 0;
    playPauseButton.isActive = 0;
    fastForwardButton.isActive = 0;
    saveButton.isActive = 0;
    leftButton.isActive = 0;
    rightButton.isActive = 0;
    upButton.isActive = 0;
    downButton.isActive = 0;
    
    // Prevent accidental loading
    if(buttonHold == 0) return;
    
    if(interfaceSelection == memory){
        // Load Song from EEPROM
    } else if(interfaceSelection == instrument){
        // Load Instrument from EEPROM
    }
    
    readControlArray(audioControlArray);
    selectionChanged = 1;
}

void ctrlSave(int buttonHold)
{
    // Disable other active states in case multiple buttons are pressed
    rewindButton.isActive = 0;
    playPauseButton.isActive = 0;
    fastForwardButton.isActive = 0;
    loadButton.isActive = 0;
    leftButton.isActive = 0;
    rightButton.isActive = 0;
    upButton.isActive = 0;
    downButton.isActive = 0;
    
    // Don't save unless the button is held
    if(buttonHold == 0) return;
    
    if(interfaceSelection == memory){
        // Save song to EEPROM
    } else if(interfaceSelection == instrument){
        // Save instrument to EEPROM
    }
    
    writeControlArray(audioControlArray);
    selectionChanged = 1;
}

void ctrlLeft(int buttonHold)
{
    // Disable other active states in case multiple buttons are pressed
    rewindButton.isActive = 0;
    playPauseButton.isActive = 0;
    fastForwardButton.isActive = 0;
    loadButton.isActive = 0;
    saveButton.isActive = 0;
    rightButton.isActive = 0;
    upButton.isActive = 0;
    downButton.isActive = 0;
    
    interfaceSelection--;
    if(interfaceSelection < 0) interfaceSelection = 19;
    
    selectionChanged = 1;
    
    // UPDATE LEDS
}

