JulesCalella/ADB-02X/dsPIC33CH512MP506_Pins.c
void ctrlRight(int buttonHold)
{
    // Disable other active states in case multiple buttons are pressed
    rewindButton.isActive = 0;
    playPauseButton.isActive = 0;
    fastForwardButton.isActive = 0;
    loadButton.isActive = 0;
    saveButton.isActive = 0;
    leftButton.isActive = 0;
    upButton.isActive = 0;
    downButton.isActive = 0;
    
    interfaceSelection++;
    if(interfaceSelection > 19) interfaceSelection = 0;
    
    selectionChanged = 1;
    
    // UPDATE LEDS
}

void ctrlUp(int buttonHold)
{
    // Disable other active states in case multiple buttons are pressed
    rewindButton.isActive = 0;
    playPauseButton.isActive = 0;
    fastForwardButton.isActive = 0;
    loadButton.isActive = 0;
    saveButton.isActive = 0;
    leftButton.isActive = 0;
    rightButton.isActive = 0;
    downButton.isActive = 0;
    
    if(buttonHold == 0){ 
        selectionAmplitude = 1;
    } else {
        selectionAmplitude = 5;
    }
    
    selectionChanged = 1;
}

void ctrlDown(int buttonHold)
{
    // Disable other active states in case multiple buttons are pressed
    rewindButton.isActive = 0;
    playPauseButton.isActive = 0;
    fastForwardButton.isActive = 0;
    loadButton.isActive = 0;
    saveButton.isActive = 0;
    leftButton.isActive = 0;
    rightButton.isActive = 0;
    upButton.isActive = 0;
    
    if(buttonHold == 0){
        selectionAmplitude = -1;
    } else {
        selectionAmplitude = -5;
    }
    
    selectionChanged = 1;
}

void updateButton(buttonStruct *button, void (*functionPtr)(int), int status)
{
    if(status == 0){    // Button is pressed
        button->isPressed = 1;
        button->isReleased = 0;
        button->pressDuration++;
        button->releaseDuration = 0;
        
        // First Press
        if((button->pressDuration > BTN_DURATION) && (button->isActive == 0)){
            (*functionPtr)(0);
            button->isActive = 1;
            
            return;
        }
        
        // Continuous Hold
        if((button->pressDuration > BTN_HOLD_DURATION) && (button->isActive == 1)){
            (*functionPtr)(1);
            button->pressDuration -= BTN_HOLD_DURATION / 2;
            return;
        }
    }
    
    if(status == 1){    // Button is released
        button->isPressed = 0;
        button->isReleased = 1;
        button->pressDuration = 0;
        button->releaseDuration++;
        
        if((button->releaseDuration > BTN_DURATION) &&(button->isActive = 1)){
            button->isActive = 0;
        }
    }
}

/* controlArray Values:
 * 0 - Overtone 1 Amplitude
 * 1 - Overtone 2 Amplitude
 * 2 - Overtone 3 Amplitude
 * 3 - Overtone 4 Amplitude
 * 4 - Overtone 5 Amplitude
 * 5 - Overtone 6 Amplitude
 * 6 - Overtone 7 Amplitude
 * 7 - Overtone 8 Amplitude
 * 8 - Overtone 9 Amplitude
 * 9 - Sine Wave Amplitude
 * 10 - Square Wave Amplitude
 * 11 - Triangle Wave Amplitude
 * 12 - Sawtooth Wave Amplitude
 * 13 - Attack Value
 * 14 - Release Value
 * 15 - Function 1
 * 16 - Function 2
 * 17 - Function 3
 * */
void updateInterface()
{
    readButtons();
    
    if(selectionChanged != 0){
        selectionChanged = 0;
        
        switch(interfaceSelection){
            case 0: // Sine Wave
                updateAmplitude(9);
                updateLeds(sine);
                break;

            case 1: // Square Wave
                updateAmplitude(10);
                updateLeds(square);
                break;

            case 2: // Triangle Wave
                updateAmplitude(11);
                updateLeds(triangle);
                break;

            case 3: // Sawtooth Wave
                updateAmplitude(12);
                updateLeds(sawtooth);
                break;

            case 4: // Attack
                updateAmplitude(13);
                updateLeds(attack);
                break;

            case 5: // Decay
                updateAmplitude(14);
                updateLeds(decay);
                break;

            case 6: // Instrument

                updateLeds(instrument);
                break;

            case 7: // Memory

                updateLeds(memory);
                break;

            case 8: // Overtone 1
                updateAmplitude(0);
                updateLeds(one);
                break;

            case 9: // Overtone 2
                updateAmplitude(1);
                updateLeds(two);
                break;

            case 10: // Overtone 3
                updateAmplitude(2);
                updateLeds(three);
                break;

            case 11: // Overtone 4
                updateAmplitude(3);
                updateLeds(four);
                break;

            case 12: // Overtone 5
                updateAmplitude(4);
                updateLeds(five);
                break;

            case 13: // Overtone 6
                updateAmplitude(5);
                updateLeds(six);
                break;

            case 14: // Overtone 7
                updateAmplitude(6);
                updateLeds(seven);
                break;

            case 15: // Overtone 8
                updateAmplitude(7);
                updateLeds(eight);
                break;

            case 16: // Overtone 9
                updateAmplitude(8);
                updateLeds(nine);
                break;

            case 17: // Function 1
                updateAmplitude(9);
                updateLeds(f1);
                break;

            case 18: // Function 2
                updateAmplitude(10);
                updateLeds(f2);
                break;

            case 19: // Function 3
                updateAmplitude(11);
                updateLeds(f3);
                break;
        }

        updateNumberDisplay();
    }
}

void ledInit()
{
    int i;
    
    readControlArray(audioControlArray);
    
    ledControlArray[0] = 1;
    interfaceSelection = 0;
    
    for(i=1; i<42; i++){
        ledControlArray[i] = 0;
    }
}

void updateAmplitude(int arrayIndex)
{
    audioControlArray[arrayIndex] += selectionAmplitude;
    if(audioControlArray[arrayIndex] > 100) audioControlArray[arrayIndex] = 100;
    if(audioControlArray[arrayIndex] < 0) audioControlArray[arrayIndex] = 0;
    numberDisplay = audioControlArray[arrayIndex];
    selectionAmplitude = 0;
}

void updateLeds(int ledChoice)
{
    ledControlArray[currentLedOn] = 0;
    ledControlArray[ledChoice] = 1;
    currentLedOn = ledChoice;
}

