JulesCalella/ADB-02X/dsPIC33CH512MP506_Pins.c
void updateNumberDisplay()
{
    // Update the seven segment displays
    int ones, tens, hundreds;
    ones = numberDisplay % 10;
    tens = (numberDisplay / 10) % 10;
    hundreds = (numberDisplay / 100) % 10;
    
    switch(ones){
        case 0:
            ledControlArray[d24a] = 1;
            ledControlArray[d24b] = 1;
            ledControlArray[d24c] = 1;
            ledControlArray[d24d] = 1;
            ledControlArray[d24e] = 1;
            ledControlArray[d24f] = 1;
            ledControlArray[d24g] = 0;
            break;
            
        case 1:
            ledControlArray[d24a] = 0;
            ledControlArray[d24b] = 1;
            ledControlArray[d24c] = 1;
            ledControlArray[d24d] = 0;
            ledControlArray[d24e] = 0;
            ledControlArray[d24f] = 0;
            ledControlArray[d24g] = 0;
            break;
            
        case 2:
            ledControlArray[d24a] = 1;
            ledControlArray[d24b] = 1;
            ledControlArray[d24c] = 0;
            ledControlArray[d24d] = 1;
            ledControlArray[d24e] = 1;
            ledControlArray[d24f] = 0;
            ledControlArray[d24g] = 1;
            break;
            
        case 3:
            ledControlArray[d24a] = 1;
            ledControlArray[d24b] = 1;
            ledControlArray[d24c] = 1;
            ledControlArray[d24d] = 1;
            ledControlArray[d24e] = 0;
            ledControlArray[d24f] = 0;
            ledControlArray[d24g] = 1;
            break;
            
        case 4:
            ledControlArray[d24a] = 0;
            ledControlArray[d24b] = 1;
            ledControlArray[d24c] = 1;
            ledControlArray[d24d] = 0;
            ledControlArray[d24e] = 0;
            ledControlArray[d24f] = 1;
            ledControlArray[d24g] = 1;
            break;
            
        case 5:
            ledControlArray[d24a] = 1;
            ledControlArray[d24b] = 0;
            ledControlArray[d24c] = 1;
            ledControlArray[d24d] = 1;
            ledControlArray[d24e] = 0;
            ledControlArray[d24f] = 1;
            ledControlArray[d24g] = 1;
            break;
            
        case 6:
            ledControlArray[d24a] = 1;
            ledControlArray[d24b] = 0;
            ledControlArray[d24c] = 1;
            ledControlArray[d24d] = 1;
            ledControlArray[d24e] = 1;
            ledControlArray[d24f] = 1;
            ledControlArray[d24g] = 1;
            break;
            
        case 7:
            ledControlArray[d24a] = 1;
            ledControlArray[d24b] = 1;
            ledControlArray[d24c] = 1;
            ledControlArray[d24d] = 0;
            ledControlArray[d24e] = 0;
            ledControlArray[d24f] = 0;
            ledControlArray[d24g] = 0;
            break;
            
        case 8:
            ledControlArray[d24a] = 1;
            ledControlArray[d24b] = 1;
            ledControlArray[d24c] = 1;
            ledControlArray[d24d] = 1;
            ledControlArray[d24e] = 1;
            ledControlArray[d24f] = 1;
            ledControlArray[d24g] = 1;
            break;
            
        case 9:
            ledControlArray[d24a] = 1;
            ledControlArray[d24b] = 1;
            ledControlArray[d24c] = 1;
            ledControlArray[d24d] = 1;
            ledControlArray[d24e] = 0;
            ledControlArray[d24f] = 1;
            ledControlArray[d24g] = 1;
            break;
    }
    
    switch(tens){
        case 0:
            ledControlArray[d23a] = 1;
            ledControlArray[d23b] = 1;
            ledControlArray[d23c] = 1;
            ledControlArray[d23d] = 1;
            ledControlArray[d23e] = 1;
            ledControlArray[d23f] = 1;
            ledControlArray[d23g] = 0;
            break;
            
        case 1:
            ledControlArray[d23a] = 0;
            ledControlArray[d23b] = 1;
            ledControlArray[d23c] = 1;
            ledControlArray[d23d] = 0;
            ledControlArray[d23e] = 0;
            ledControlArray[d23f] = 0;
            ledControlArray[d23g] = 0;
            break;
            
        case 2:
            ledControlArray[d23a] = 1;
            ledControlArray[d23b] = 1;
            ledControlArray[d23c] = 0;
            ledControlArray[d23d] = 1;
            ledControlArray[d23e] = 1;
            ledControlArray[d23f] = 0;
            ledControlArray[d23g] = 1;
            break;
            
        case 3:
            ledControlArray[d23a] = 1;
            ledControlArray[d23b] = 1;
            ledControlArray[d23c] = 1;
            ledControlArray[d23d] = 1;
            ledControlArray[d23e] = 0;
            ledControlArray[d23f] = 0;
            ledControlArray[d23g] = 1;
            break;
            
        case 4:
            ledControlArray[d23a] = 0;
            ledControlArray[d23b] = 1;
            ledControlArray[d23c] = 1;
            ledControlArray[d23d] = 0;
            ledControlArray[d23e] = 0;
            ledControlArray[d23f] = 1;
            ledControlArray[d23g] = 1;
            break;
            
        case 5:
            ledControlArray[d23a] = 1;
            ledControlArray[d23b] = 0;
            ledControlArray[d23c] = 1;
            ledControlArray[d23d] = 1;
            ledControlArray[d23e] = 0;
            ledControlArray[d23f] = 1;
            ledControlArray[d23g] = 1;
            break;
            
        case 6:
            ledControlArray[d23a] = 1;
            ledControlArray[d23b] = 0;
            ledControlArray[d23c] = 1;
            ledControlArray[d23d] = 1;
            ledControlArray[d23e] = 1;
            ledControlArray[d23f] = 1;
            ledControlArray[d23g] = 1;
            break;
            
        case 7:
            ledControlArray[d23a] = 1;
            ledControlArray[d23b] = 1;
            ledControlArray[d23c] = 1;
            ledControlArray[d23d] = 0;
            ledControlArray[d23e] = 0;
            ledControlArray[d23f] = 0;
            ledControlArray[d23g] = 0;
            break;
            
        case 8:
            ledControlArray[d23a] = 1;
            ledControlArray[d23b] = 1;
            ledControlArray[d23c] = 1;
            ledControlArray[d23d] = 1;
            ledControlArray[d23e] = 1;
            ledControlArray[d23f] = 1;
            ledControlArray[d23g] = 1;
            break;
            
        case 9:
            ledControlArray[d23a] = 1;
            ledControlArray[d23b] = 1;
            ledControlArray[d23c] = 1;
            ledControlArray[d23d] = 1;
            ledControlArray[d23e] = 0;
            ledControlArray[d23f] = 1;
            ledControlArray[d23g] = 1;
            break;
    }
    
