JulesCalella/ADB-02X/dsPIC33CH512MP506_Pins.c
    switch(hundreds){
        case 0:
            ledControlArray[d22a] = 1;
            ledControlArray[d22b] = 1;
            ledControlArray[d22c] = 1;
            ledControlArray[d22d] = 1;
            ledControlArray[d22e] = 1;
            ledControlArray[d22f] = 1;
            ledControlArray[d22g] = 0;
            break;
            
        case 1:
            ledControlArray[d22a] = 0;
            ledControlArray[d22b] = 1;
            ledControlArray[d22c] = 1;
            ledControlArray[d22d] = 0;
            ledControlArray[d22e] = 0;
            ledControlArray[d22f] = 0;
            ledControlArray[d22g] = 0;
            break;
            
        case 2:
            ledControlArray[d22a] = 1;
            ledControlArray[d22b] = 1;
            ledControlArray[d22c] = 0;
            ledControlArray[d22d] = 1;
            ledControlArray[d22e] = 1;
            ledControlArray[d22f] = 0;
            ledControlArray[d22g] = 1;
            break;
            
        case 3:
            ledControlArray[d22a] = 1;
            ledControlArray[d22b] = 1;
            ledControlArray[d22c] = 1;
            ledControlArray[d22d] = 1;
            ledControlArray[d22e] = 0;
            ledControlArray[d22f] = 0;
            ledControlArray[d22g] = 1;
            break;
            
        case 4:
            ledControlArray[d22a] = 0;
            ledControlArray[d22b] = 1;
            ledControlArray[d22c] = 1;
            ledControlArray[d22d] = 0;
            ledControlArray[d22e] = 0;
            ledControlArray[d22f] = 1;
            ledControlArray[d22g] = 1;
            break;
            
        case 5:
            ledControlArray[d22a] = 1;
            ledControlArray[d22b] = 0;
            ledControlArray[d22c] = 1;
            ledControlArray[d22d] = 1;
            ledControlArray[d22e] = 0;
            ledControlArray[d22f] = 1;
            ledControlArray[d22g] = 1;
            break;
            
        case 6:
            ledControlArray[d22a] = 1;
            ledControlArray[d22b] = 0;
            ledControlArray[d22c] = 1;
            ledControlArray[d22d] = 1;
            ledControlArray[d22e] = 1;
            ledControlArray[d22f] = 1;
            ledControlArray[d22g] = 1;
            break;
            
        case 7:
            ledControlArray[d22a] = 1;
            ledControlArray[d22b] = 1;
            ledControlArray[d22c] = 1;
            ledControlArray[d22d] = 0;
            ledControlArray[d22e] = 0;
            ledControlArray[d22f] = 0;
            ledControlArray[d22g] = 0;
            break;
            
        case 8:
            ledControlArray[d22a] = 1;
            ledControlArray[d22b] = 1;
            ledControlArray[d22c] = 1;
            ledControlArray[d22d] = 1;
            ledControlArray[d22e] = 1;
            ledControlArray[d22f] = 1;
            ledControlArray[d22g] = 1;
            break;
            
        case 9:
            ledControlArray[d22a] = 1;
            ledControlArray[d22b] = 1;
            ledControlArray[d22c] = 1;
            ledControlArray[d22d] = 1;
            ledControlArray[d22e] = 0;
            ledControlArray[d22f] = 1;
            ledControlArray[d22g] = 1;
            break;
    }
}

void ledsOff()
{
    LED1 = 0; 
    LED2 = 0; 
    LED3 = 0;
    LED4 = 0; 
    LED5 = 0; 
    LED6 = 0;
    LED7 = 0;
    
    CTRL1 = 0; 
    CTRL2 = 0; 
    CTRL3 = 0;
    CTRL4 = 0; 
    CTRL5 = 0; 
    CTRL6 = 0;
}

void ledControlDisable()
{
    ledControlEnabled = 0;
}

void ledControlEnable()
{
    ledControlEnabled = 1;
}

void singleLedControl(int currentLed)
{
    // Start by turning off all LEDs
    ledsOff();
    
    Nop();
    Nop();
    Nop();
    
    switch(currentLed){
    // CTRL 1
        case 0: // D1
            LED1 = 1;
            CTRL1 = 1;
            break;
            
        case 1: // D4
            LED2 = 1;
            CTRL1 = 1;
            break;
            
        case 2: // D7
            LED3 = 1;
            CTRL1 = 1;
            break;
            
        case 3: // D10
            LED4 = 1;
            CTRL1 = 1;
            break;
            
        case 4: // D13
            LED5 = 1;
            CTRL1 = 1;
            break;
            
        case 5: // D16
            LED6 = 1;
            CTRL1 = 1;
            break;
            
        case 6: // D19
            LED7 = 1;
            CTRL1 = 1;
            break;
            
    // CTRL 2
        case 7: // D2
            LED1 = 1;
            CTRL2 = 1;
            break;
            
        case 8: // D5
            LED2 = 1;
            CTRL2 = 1;
            break;
            
        case 9: // D8
            LED3 = 1;
            CTRL2 = 1;
            break;
            
        case 10: // D11
            LED4 = 1;
            CTRL2 = 1;
            break;
            
        case 11: // D14
            LED5 = 1;
            CTRL2 = 1;
            break;
            
        case 12: // D17
            LED6 = 1;
            CTRL2 = 1;
            break;
            
        case 13: // D20
            LED7 = 1;
            CTRL2 = 1;
            break;
            
    // CTRL 3
        case 14: // D3
            LED1 = 1;
            CTRL3 = 1;
            break;
            
        case 15: // D6
            LED2 = 1;
            CTRL3 = 1;
            break;
            
        case 16: // D9
            LED3 = 1;
            CTRL3 = 1;
            break;
            
        case 17: // D12
            LED4 = 1;
            CTRL3 = 1;
            break;
            
        case 18: // D15
            LED5 = 1;
            CTRL3 = 1;
            break;
            
        case 19: // D18
            LED6 = 1;
            CTRL3 = 1;
            break;
            
        case 20: // D21
            LED7 = 1;
            CTRL3 = 1;
            break;
            
    // CTRL 4
        case 21: // D22 E
            LED1 = 1;
            CTRL4 = 1;
            break;
            
        case 22: // D22 D
            LED2 = 1;
            CTRL4 = 1;
            break;
            
        case 23: // D22 C
            LED3 = 1;
            CTRL4 = 1;
            break;
            
