JulesCalella/ADB-02X/dsPIC33CH512MP506_Pins.c
        case 24: // D22 B
            LED4 = 1;
            CTRL4 = 1;
            break;
            
        case 25: // D22 A
            LED5 = 1;
            CTRL4 = 1;
            break;
            
        case 26: // D22 F
            LED6 = 1;
            CTRL4 = 1;
            break;
            
        case 27: // D22 G
            LED7 = 1;
            CTRL4 = 1;
            break;
          
    // CTRL 5
        case 28: // D24 E
            LED1 = 1;
            CTRL5 = 1;
            break;
            
        case 29: // D24 D
            LED2 = 1;
            CTRL5 = 1;
            break;
            
        case 30: // D24 C
            LED3 = 1;
            CTRL5 = 1;
            break;
            
        case 31: // D24 B
            LED4 = 1;
            CTRL5 = 1;
            break;
            
        case 32: // D24 A
            LED5 = 1;
            CTRL5 = 1;
            break;
            
        case 33: // D24 F
            LED6 = 1;
            CTRL5 = 1;
            break;
            
        case 34: // D24 G
            LED7 = 1;
            CTRL5 = 1;
            break;
       
    // CTRL 6
        case 35: // D24 E
            LED1 = 1;
            CTRL6 = 1;
            break;
            
        case 36: // D24 D
            LED2 = 1;
            CTRL6 = 1;
            break;
            
        case 37: // D24 C
            LED3 = 1;
            CTRL6 = 1;
            break;
            
        case 38: // D24 B
            LED4 = 1;
            CTRL6 = 1;
            break;
            
        case 39: // D24 A
            LED5 = 1;
            CTRL6 = 1;
            break;
            
        case 40: // D24 F
            LED6 = 1;
            CTRL6 = 1;
            break;
            
        case 41: // D24 G
            LED7 = 1;
            CTRL6 = 1;
            break;     
    }
}

// TEMPORARY FUNCTION FOR TESTING LEDS
void currentLedIncrement()
{
    tempCounter++;
    
    if(tempCounter > 10){
        ledControl();
        currentLed++;
        if(currentLed >= 42) currentLed = 0;
        tempCounter = 0;
    }
    
}

void ledControl()
{
    //if(ledControlEnabled == 0) return;
    
    switch(currentLed){
    // ** CTRL1 ** //
        // LED D1 -|>-
        case 0:
            CTRL6 = 0;
            LED7 = 0;
            CTRL1 = 1;
            
            if(ledControlArray[0] == 1){
                LED1 = 1;
            }
            
            break;
        
        // LED D4 -|>-
        case 1:
            LED1 = 0;
            
            if(ledControlArray[1] == 1){
                LED2 = 1;
            }
            
            break;
            
        // LED D7 -|>-
        case 2:
            LED2 = 0;
            
            if(ledControlArray[2] == 1){
                LED3 = 1;
            }
            
            break;
         
        // LED D10 -|>-
        case 3:
            LED3 = 0;
            
            if(ledControlArray[3] == 1){
                LED4 = 1;
            }
            
            break;
        
        // LED D13 -|>-
        case 4:
            LED4 = 0;
            
            if(ledControlArray[4] == 1){
                LED5 = 1;
            }
            
            break;
        
        // LED D16 -|>-
        case 5:
            LED5 = 0;
            
            if(ledControlArray[5] == 1){
                LED6 = 1;
            }
            
            break;
            
        // LED D19 -|>-
        case 6:
            LED6 = 0;
            
            if(ledControlArray[6] == 1){
                LED7 = 1;
            }
            
            break;
        
        
    // ** CTRL2 ** //
        // LED D2 -|>-
        case 7:
            CTRL1 = 0;
            LED7 = 0;
            CTRL2 = 1;
            
            if(ledControlArray[7] == 1){
                LED1 = 1;
            }
            
            break;
            
        // LED D5 -|>-
        case 8:
            LED1 = 0;
            
            if(ledControlArray[8] == 1){
                LED2 = 1;
            }
            
            break;
            
        // LED D8 -|>-
        case 9:
            LED2 = 0;
            
            if(ledControlArray[9] == 1){
                LED3 = 1;
            }
            
            break;
            
        // LED D11 -|>-
        case 10:
            LED3 = 0;
            
            if(ledControlArray[10] == 1){
                LED4 = 1;
            }
            
            break;
            
        // LED D14 -|>-
        case 11:
            LED4 = 0;
            
            if(ledControlArray[11] == 1){
                LED5 = 1;
            }
            
            break;
            
        // LED D17 -|>-
        case 12:
            LED5 = 0;
            
            if(ledControlArray[12] == 1){
                LED6 = 1;
            }
            
            break;
            
        // LED D20 -|>-
        case 13:
            LED6 = 0;
            
            if(ledControlArray[13] == 1){
                LED7 = 1;
            }
            
            break;
            
    // ** CTRL3 ** //
        // LED D3 -|>-
        case 14:
            CTRL2 = 0;
            LED7 = 0;
            CTRL3 = 1;
            
            if(ledControlArray[14] == 1){
                LED1 = 1;
            }
            
            break;
            
        // LED D6 -|>-
        case 15:
            LED1 = 0;
            
            if(ledControlArray[15] == 1){
                LED2 = 1;
            }
            
            break;
            
        // LED D9 -|>-
        case 16:
            LED2 = 0;
            
            if(ledControlArray[16] == 1){
                LED3 = 1;
            }
            
            break;
            
        // LED D12 -|>-
        case 17:
            LED3 = 0;
            
            if(ledControlArray[17] == 1){
                LED4 = 1;
            }
            
            break;
            
        // LED D15 -|>-
        case 18:
            LED4 = 0;
            
            if(ledControlArray[18] == 1){
                LED5 = 1;
            }
            
            break;
            
