JulesCalella/ADB-02X/dsPIC33CH512MP506_Pins.c
        // LED D18 -|>-
        case 19:
            LED5 = 0;
            
            if(ledControlArray[19] == 1){
                LED6 = 1;
            }
            
            break;
            
        // LED D21 -|>-
        case 20:
            LED6 = 0;
            
            if(ledControlArray[20] == 1){
                LED7 = 1;
            }
            
            break;
            
    // ** CTRL4 ** //
        // LED D22 -|>- E
        case 21:
            CTRL3 = 0;
            LED7 = 0;
            CTRL4 = 1;
            
            if(ledControlArray[21] == 1){
                LED1 = 1;
            }
            
            break;
            
        // LED D22 -|>- D
        case 22:
            LED1 = 0;
            
            if(ledControlArray[22] == 1){
                LED2 = 1;
            }
            
            break;
            
        // LED D22 -|>- C
        case 23:
            LED2 = 0;
            
            if(ledControlArray[23] == 1){
                LED3 = 1;
            }
            
            break;
            
        // LED D22 -|>- B
        case 24:
            LED3 = 0;
            
            if(ledControlArray[24] == 1){
                LED4 = 1;
            }
            
            break;
            
        // LED D22 -|>- A
        case 25:
            LED4 = 0;
            
            if(ledControlArray[25] == 1){
                LED5 = 1;
            }
            
            break;
            
        // LED D22 -|>- F
        case 26:
            LED5 = 0;
            
            if(ledControlArray[26] == 1){
                LED6 = 1;
            }
            
            break;
            
        // LED D22 -|>- G
        case 27:
            LED6 = 0;
            
            if(ledControlArray[27] == 1){
                LED7 = 1;
            }
            
            break;
            
    // ** CTRL5 ** //
        // LED D23 -|>- E
        case 28:
            CTRL4 = 0;
            LED7 = 0;
            CTRL5 = 1;
            
            if(ledControlArray[28] == 1){
                LED1 = 1;
            }
            
            break;
            
        // LED D23 -|>- D
        case 29:
            LED1 = 0;
            
            if(ledControlArray[29] == 1){
                LED2 = 1;
            }
            
            break;
            
        // LED D23 -|>- C
        case 30:
            LED2 = 0;
            
            if(ledControlArray[30] == 1){
                LED3 = 1;
            }
            
            break;
            
        // LED D23 -|>- B
        case 31:
            LED3 = 0;
            
            if(ledControlArray[31] == 1){
                LED4 = 1;
            }
            
            break;
            
        // LED D23 -|>- A
        case 32:
            LED4 = 0;
            
            if(ledControlArray[32] == 1){
                LED5 = 1;
            }
            
            break;
            
        // LED D23 -|>- F
        case 33:
            LED5 = 0;
            
            if(ledControlArray[33] == 1){
                LED6 = 1;
            }
            
            break;
            
        // LED D23 -|>- G
        case 34:
            LED6 = 0;
            
            if(ledControlArray[34] == 1){
                LED7 = 1;
            }
            
            break;
            
    // ** CTRL6 ** //
        // LED D24 -|>- E
        case 35:
            CTRL5 = 0;
            LED7 = 0;
            CTRL6 = 1;
            
            if(ledControlArray[35] == 1){
                LED1 = 1;
            }
            
            break;
            
        // LED D24 -|>- D
        case 36:
            LED1 = 0;
            
            if(ledControlArray[36] == 1){
                LED2 = 1;
            }
            
            break;
            
        // LED D24 -|>- C
        case 37:
            LED2 = 0;
            
            if(ledControlArray[37] == 1){
                LED3 = 1;
            }
            
            break;
            
        // LED D24 -|>- B
        case 38:
            LED3 = 0;
            
            if(ledControlArray[38] == 1){
                LED4 = 1;
            }
            
            break;
            
        // LED D24 -|>- A
        case 39:
            LED4 = 0;
            
            if(ledControlArray[39] == 1){
                LED5 = 1;
            }
            
            break;
            
        // LED D24 -|>- F
        case 40:
            LED5 = 0;
            
            if(ledControlArray[40] == 1){
                LED6 = 1;
            }
            
            break;
            
        // LED D24 -|>- G
        case 41:
            LED6 = 0;
            
            if(ledControlArray[41] == 1){
                LED7 = 1;
            }
            
            break;
    }
}

void ledDisplaySequence()
{
    int delay = 5;
    
    ledControlDisable();
    
    singleLedControl(tempo); ledTimeDelay(delay);
    singleLedControl(memory); ledTimeDelay(delay);
    singleLedControl(instrument); ledTimeDelay(delay);
    singleLedControl(decay); ledTimeDelay(delay);
    singleLedControl(attack); ledTimeDelay(delay);
    singleLedControl(sawtooth); ledTimeDelay(delay);
    singleLedControl(triangle); ledTimeDelay(delay);
    singleLedControl(square); ledTimeDelay(delay);
    singleLedControl(sine); ledTimeDelay(delay);
    singleLedControl(one); ledTimeDelay(delay);
    singleLedControl(two); ledTimeDelay(delay);
    singleLedControl(three); ledTimeDelay(delay);
    singleLedControl(four); ledTimeDelay(delay);
    singleLedControl(five); ledTimeDelay(delay);
    singleLedControl(six); ledTimeDelay(delay);
    singleLedControl(seven); ledTimeDelay(delay);
    singleLedControl(eight); ledTimeDelay(delay);
    singleLedControl(nine); ledTimeDelay(delay);
    singleLedControl(f1); ledTimeDelay(delay);
    singleLedControl(f2); ledTimeDelay(delay);
    singleLedControl(f3); ledTimeDelay(delay);
    singleLedControl(d22d); ledTimeDelay(delay);
    singleLedControl(d22c); ledTimeDelay(delay);
    singleLedControl(d22g); ledTimeDelay(delay);
    singleLedControl(d22f); ledTimeDelay(delay);
    singleLedControl(d22a); ledTimeDelay(delay);
    singleLedControl(d23a); ledTimeDelay(delay);
    singleLedControl(d23b); ledTimeDelay(delay);
    singleLedControl(d23g); ledTimeDelay(delay);
    singleLedControl(d23e); ledTimeDelay(delay);
    singleLedControl(d23d); ledTimeDelay(delay);
    singleLedControl(d24d); ledTimeDelay(delay);
    singleLedControl(d24c); ledTimeDelay(delay);
    singleLedControl(d24g); ledTimeDelay(delay);
    singleLedControl(d24f); ledTimeDelay(delay);
    singleLedControl(d24a); ledTimeDelay(delay);
    singleLedControl(d24b); ledTimeDelay(delay);
    singleLedControl(d24c); ledTimeDelay(delay);
    singleLedControl(d24d); ledTimeDelay(delay);
    singleLedControl(d23d); ledTimeDelay(delay);
    singleLedControl(d22d); ledTimeDelay(delay);
    singleLedControl(f3); ledTimeDelay(delay);
    singleLedControl(f2); ledTimeDelay(delay);
    singleLedControl(f1); ledTimeDelay(delay);
    singleLedControl(nine); ledTimeDelay(delay);
    singleLedControl(tempo); ledTimeDelay(delay);
    ledsOff();ledTimeDelay(delay);
    
    ledControlEnable();
}

