JulesCalella/ADB-02X/dsPIC33CH512MP506_Pins.c
void ledTimeDelay(int maxDelay)
{
    int delay;
    int count;
    
    for(delay=0; delay<maxDelay; delay++){
        for(count=0; count<0x7FFF; count++){
            Nop();
        }
    }
}

// FFC1 Functions
void io_ffc1(int selection)
{
    if(selection == 0) TRISCbits.TRISC10 = 0;
    else TRISCbits.TRISC10 = 1;
}

void set_ffc1(int selection)
{
    FFC1_O = selection;
}

int read_ffc1()
{
   return FFC1_I; 
}

// FFC2 Functions
void io_ffc2(int selection)
{
    if(selection == 0) TRISCbits.TRISC5 = 0;
    else TRISCbits.TRISC5 = 1;
}

void set_ffc2(int selection)
{
    FFC2_O = selection;
}

int read_ffc2()
{
   return FFC2_I; 
}

// FFC3 Functions
void io_ffc3(int selection)
{
    if(selection == 0) TRISCbits.TRISC4 = 0;
    else TRISCbits.TRISC4 = 1;
}

void set_ffc3(int selection)
{
    FFC3_O = selection;
}

int read_ffc3()
{
   return FFC3_I; 
}

// FFC4 Functions
void io_ffc4(int selection)
{
    if(selection == 0) TRISBbits.TRISB7 = 0;
    else TRISBbits.TRISB7 = 1;
}

void set_ffc4(int selection)
{
    FFC4_O = selection;
}

int read_ffc4()
{
   return FFC4_I; 
}

// FFC5 Functions
void io_ffc5(int selection)
{
    if(selection == 0) TRISDbits.TRISD5 = 0;
    else TRISDbits.TRISD5 = 1;
}

void set_ffc5(int selection)
{
    FFC5_O = selection;
}

int read_ffc5()
{
   return FFC5_I; 
}

// FFC6 Functions
void io_ffc6(int selection)
{
    if(selection == 0) TRISDbits.TRISD6 = 0;
    else TRISDbits.TRISD6 = 1;
}

void set_ffc6(int selection)
{
    FFC6_O = selection;
}

int read_ffc6()
{
   return FFC6_I; 
}

// FFC7 Functions
void io_ffc7(int selection)
{
    if(selection == 0) TRISDbits.TRISD8 = 0;
    else TRISDbits.TRISD8 = 1;
}

void set_ffc7(int selection)
{
    FFC7_O = selection;
}

int read_ffc7()
{
   return FFC7_I; 
}

// FFC8 Functions
void io_ffc8(int selection)
{
    if(selection == 0) TRISDbits.TRISD9 = 0;
    else TRISDbits.TRISD9 = 1;
}

void set_ffc8(int selection)
{
    FFC8_O = selection;
}

int read_ffc8()
{
   return FFC8_I; 
}

// FFC9 Functions
void io_ffc9(int selection)
{
    if(selection == 0) TRISCbits.TRISC9 = 0;
    else TRISCbits.TRISC9 = 1;
}

void set_ffc9(int selection)
{
    FFC9_O = selection;
}

int read_ffc9()
{
   return FFC9_I; 
}

// FFC10 Functions
void io_ffc10(int selection)
{
    if(selection == 0) TRISCbits.TRISC9 = 0;
    else TRISCbits.TRISC9 = 1;
}

void set_ffc10(int selection)
{
    FFC10_O = selection;
}

int read_ffc10()
{
   return FFC10_I; 
}

// FFC11 Functions
void io_ffc11(int selection)
{
    if(selection == 0) TRISBbits.TRISB2 = 0;
    else TRISBbits.TRISB2 = 1;
}

void set_ffc11(int selection)
{
    FFC11_O = selection;
}

int read_ffc11()
{
   return FFC11_I; 
}

// FFC12 Functions
void io_ffc12(int selection)
{
    if(selection == 0) TRISCbits.TRISC7 = 0;
    else TRISCbits.TRISC7 = 1;
}

void set_ffc12(int selection)
{
    FFC12_O = selection;
}

int read_ffc12()
{
   return FFC12_I; 
}

void set_wp(int selection)
{
    WP = selection;
}

void ledDeviceFail()
{
    singleLedControl(f1); ledTimeDelay(1000);
    singleLedControl(f3); ledTimeDelay(1000);
}

void tempoLedToggle()
{
    if(ledControlArray[tempo] == 1) ledControlArray[tempo] = 0;
    else ledControlArray[tempo] = 1;
}